# <font color='blue'>Data Science Academy</font>
# <font color='blue'>Big Data Real-Time Analytics com Python e Spark</font>

## <font color='blue'>Estudo de Caso 2</font>

## <font color='blue'>Data Science na Educação – Análise de Dados Escolares com Pandas</font>

![title](imagens/EstudoCaso2.png)

In [92]:
# Versão da Linguagem Python
from platform import python_version
print('Versão da Linguagem Python Usada Neste Jupyter Notebook:', python_version())

Versão da Linguagem Python Usada Neste Jupyter Notebook: 3.11.4

In [93]:
# Para atualizar um pacote, execute o comando abaixo no terminal ou prompt de comando:
# pip install -U nome_pacote

# Para instalar a versão exata de um pacote, execute o comando abaixo no terminal ou prompt de comando:
#!pip install nome_pacote==versão_desejada

# Depois de instalar ou atualizar o pacote, reinicie o jupyter notebook.

# Instala o pacote watermark. 
# Esse pacote é usado para gravar as versões de outros pacotes usados neste jupyter notebook.
#!pip install -q -U watermark

In [94]:
# Imports
import pandas as pd

## Carregando os Dados

In [95]:
# Carrega o dataset de escolas
dados_escolas = pd.read_csv("dados/dataset_escolas.csv")

In [96]:
# Shape
dados_escolas.shape

(15, 5)

In [97]:
# Visualiza
dados_escolas.head()

   ID_Escola Nome_Escola Tipo_Escola  Numero_Alunos  Orcamento_Anual
0          0    Escola A     Publica           2917          1910635
1          1    Escola B     Publica           2949          1884411
2          2    Escola C  Particular           1761          1056600
3          3    Escola D     Publica           4635          3022020
4          4    Escola E  Particular           1468           917500

In [98]:
# Dataset de estudantes
dados_estudantes = pd.read_csv("dados/dataset_estudantes.csv")

In [99]:
# Shape
dados_estudantes.shape

(39160, 7)

In [100]:
# Visualiza
dados_estudantes.head()

,ID_Estudante,Nome_Estudante,Genero,Serie,Nome_Escola,Nota_Redacao,Nota_Matematica
0,0,Kevin Bradley,M,6,Escola A,66,79
1,1,Paul Smith,M,9,Escola A,94,61
2,2,John Rodriguez,M,9,Escola A,90,60
3,3,Oliver Scott,M,9,Escola A,67,58
4,4,William Ray,F,6,Escola A,97,84

In [101]:
# Combina os datasets
dados_full = pd.merge(dados_estudantes, dados_escolas, how = "left", on = ["Nome_Escola", "Nome_Escola"])

In [102]:
# Shape
dados_full.shape

(39160, 11)

In [103]:
# Visualiza
dados_full.head()

,ID_Estudante,Nome_Estudante,Genero,Serie,Nome_Escola,Nota_Redacao,Nota_Matematica,ID_Escola,Tipo_Escola,Numero_Alunos,Orcamento_Anual
0,0,Kevin Bradley,M,6,Escola A,66,79,0,Publica,2917,1910635
1,1,Paul Smith,M,9,Escola A,94,61,0,Publica,2917,1910635
2,2,John Rodriguez,M,9,Escola A,90,60,0,Publica,2917,1910635
3,3,Oliver Scott,M,9,Escola A,67,58,0,Publica,2917,1910635
4,4,William Ray,F,6,Escola A,97,84,0,Publica,2917,1910635

In [104]:
# Séries escolares no dataset
dados_full["Serie"].unique()

array([6, 9, 8, 7], dtype=int64)

In [105]:
# Genero
dados_full["Genero"].unique()

array(['M', 'F'], dtype=object)

## Desafio de Análise de Dados

Responda as perguntas abaixo.

> **1- Temos dados de quantas escolas?**

In [106]:
count_escolas = dados_escolas['ID_Escola'].count()

> **2- Qual o total de registros de estudantes na base de dados?**

In [107]:
count_estudantes = dados_estudantes['ID_Estudante'].count()

> **3- Qual o orçamento total considerando todas as escolas?**

In [108]:
sum_price = dados_escolas['Orcamento_Anual'].sum()

> **4- Qual a média da nota dos alunos em Redação?**

In [109]:
mean_red = dados_estudantes['Nota_Redacao'].mean()

> **5- Qual a média da nota dos alunos em Matemática?**

In [110]:
mean_math = dados_estudantes['Nota_Matematica'].mean()

> **6- Considerando que a nota de aprovação é 70, quantos alunos foram aprovados em Redação? (Entregue o resultado em valor absoluto e percentual)**

In [111]:
estudante_aprov_red = dados_estudantes[dados_estudantes['Nota_Redacao'] >= 70]['Nota_Redacao'].count()

> **7- Considerando que a nota de aprovação é 70, quantos alunos foram aprovados em Matemática? (Entregue o resultado em valor absoluto e percentual)**

In [112]:
estudante_aprov_math = dados_estudantes[dados_estudantes['Nota_Matematica'] >= 70]['Nota_Matematica'].count()
estudante_math = dados_estudantes['Nota_Matematica'].count()
perc_aprov_math = estudante_aprov_math/estudante_math

In [113]:
print('Total de estudantes aprovados em matemática: ',estudante_aprov_math)
print('Percentual total de estudantes aprovados em  matemática: ',100*(estudante_aprov_math/estudante_math),'%')

Total de estudantes aprovados em matemática:  29360
Percentual total de estudantes aprovados em  matemática:  74.97446373850867 %

> **8- Considerando que a nota de aprovação é 70, quantos alunos foram aprovados em Matemática e Redação? (Entregue o resultado em valor absoluto e percentual)**

In [114]:
estudantes_aprov_red_math = dados_estudantes[(dados_estudantes['Nota_Matematica'] >= 70) & (dados_estudantes['Nota_Redacao'] >= 70)]['ID_Estudante'].count()

In [115]:
print(estudantes_aprov_red_math)

25518

> **9- Crie um dataframe com os resultados das questões de 1 a 8 que você calculou acima. (Dica: crie um dicionário e depois converta em dataframe do Pandas)**

In [116]:
education_dict = {
'Total_de_escolas':  count_escolas,
'Total_de_estudantes': count_estudantes,
'Orçamento_total': sum_price,
'Media_em_redação' :mean_red,
'Media_em_matemática': mean_math,
'Aprovados_redação' :estudante_aprov_red,
'Aprovados_matemática': estudante_aprov_math,
'Percentual_aprovados_matemática': perc_aprov_math,
'Aprovados_redação_matemática': estudantes_aprov_red_math
}

In [117]:
print(education_dict)

{'Total_de_escolas': 15, 'Total_de_estudantes': 39160, 'Orçamento_total': 24649428, 'Media_em_redação': 81.87574055158325, 'Media_em_matemática': 78.98493360572012, 'Aprovados_redação': 33600, 'Aprovados_matemática': 29360, 'Percentual_aprovados_matemática': 0.7497446373850868, 'Aprovados_redação_matemática': 25518}

In [118]:
df_estudantes = pd.DataFrame([education_dict])

In [119]:
print(df_estudantes.to_string(index=False))

 Total_de_escolas  Total_de_estudantes  Orçamento_total  Media_em_redação  Media_em_matemática  Aprovados_redação  Aprovados_matemática  Percentual_aprovados_matemática  Aprovados_redação_matemática
               15                39160         24649428         81.875741            78.984934              33600                 29360                         0.749745                         25518

> **10- Formate as colunas "Total de Estudantes" e "Total Orçamento" ajustando as casas decimais.**

In [123]:
df_estudantes["Total_de_estudantes"] = df_estudantes["Total_de_estudantes"].round(2)
df_estudantes['Orçamento_total'] = df_estudantes['Orçamento_total'].apply(lambda x: '{:.2f}'.format(x))

In [124]:
print(df_estudantes["Total_de_estudantes"].to_string(index=False))

39160

In [125]:
print(df_estudantes['Orçamento_total'].to_string(index=False))

24649428.00

# Fim